{
    "intents": [
        {
            "tag": "saludo",
            "patterns": [
                "hola",
                "¿qué tal?",
                "buenos días",
                "saludos",
                "buenas",
                "qué onda",
                "qué pasa",
                "buen día, cómo estás",
                "hola, espero que estés bien",
                "saludos, ¿cómo va todo?",
                "hola, ¿todo bien?",
                "buenas tardes, ¿cómo te va?",
                "buenos días, ¿cómo amaneciste?"
            ],
            "responses": [
                "¡Hola {name}!, ¿Cómo puedo ayudarte?",
                "¡Buenas {name}!, ¿En qué te puedo ser útil?",
                "¡Hola {name}! Espero que estés bien. ¿Cómo puedo asistirte?",
                "¡Saludos {name}!, ¿Hay algo en particular con lo que necesites ayuda?",
                "¡Hola {name}!, ¿Te puedo ayudar en algo?",
                "¡Qué tal {name}!, ¿Cómo puedo ayudarte hoy?",
                "¡Buen día {name}!, ¿Hay algo con lo que necesites asistencia?"
            ]
        },
        {
            "tag": "informacion_asistente",
            "patterns": [
                "¿Cómo te llamas?",
                "¿Cuál es tu nombre?",
                "Me gustaría saber tu nombre",
                "¿Cómo es que te llamas?",
                "Dime tu nombre",
                "¿Quién eres?",
                "¿Tienes nombre?",
                "¿Cómo te identificas?",
                "¿Cuál es tu identidad?",
                "¿Cuál es tu función aquí como asistente virtual?",
                "¿Qué haces?",
                "¿Qué funciones puedes realizar?",
                "Me gustaría saber más acerca de ti"
            ],
            "responses": [
                "Me llamo DocMe, soy tu asistente virtual aquí para ayudarte con cualquier duda que tengas, especialmente sobre tus citas médicas y más.",
                "Soy DocMe, el asistente de chat diseñado para ayudarte en tus necesidades médicas. ¿Hay algo más en lo que puedo asistirte?",
                "Mi nombre es DocMe. Facilito la gestión de tus citas médicas y me aseguro de que tu experiencia en el cuidado de la salud sea lo más fluida posible."
            ]
        },
        {
            "tag": "malestar_emocional",
            "patterns": [
                "me siento mal",
                "no muy bien",
                "fatal",
                "hoy no es mi mejor día",
                "me siento un poco deprimido últimamente",
                "últimamente me he sentido abajo",
                "me siento triste hoy",
                "tengo sentimientos de tristeza",
                "me siento emocionalmente agotado",
                "estoy lidiando con mucha ansiedad",
                "he estado sintiéndome muy deprimido"
            ],
            "responses": [
                "Lo siento mucho que te sientas así. ¿Hay algo específico que haya causado que te sientas mal últimamente? Estoy aquí para escucharte.",
                "Parece que estás pasando por un momento difícil. A veces, hablar con alguien puede ayudar mucho. ¿Te gustaría que te ponga en contacto con un consejero o un terapeuta?",
                "Lamento escuchar que te sientes de esta manera. Recuerda, no estás solo en esto y hay personas que pueden ayudarte. ¿Quieres que busque recursos de apoyo emocional para ti?",
                "Entiendo que no te sientas bien, y es totalmente válido sentirse así. Si crees que sería útil, puedo ayudarte a encontrar un grupo de apoyo o un profesional de la salud mental.",
                "Escuchar que te sientes así me preocupa. Si sientes que todo se está volviendo demasiado, es importante buscar ayuda profesional. ¿Te gustaría que te ayude a programar una cita?",
                "Es completamente normal tener días malos, pero si estos sentimientos persisten, podría ser beneficioso hablar con alguien que pueda ofrecer soporte. ¿Puedo asistirte para encontrar ayuda profesional?",
                "Lamento que te encuentres en esta situación. A veces, solo expresar lo que sientes puede ser un gran paso hacia sentirte mejor. Estoy aquí para escucharte, o si prefieres, puedo ayudarte a contactar a un profesional.",
                "Todos tenemos momentos difíciles, y hablar sobre lo que sientes es un paso importante. ¿Te gustaría que te dé información sobre cómo contactar a un especialista en salud mental?"
            ]
        },
        {
            "tag": "malestar_fisico_general",
            "patterns": [
                "enfermo",
                "grave",
                "tengo una enfermedad",
                "tengo fiebre"
            ],
            "responses": [
                "Parece que podrías estar enfermo. Sería bueno que veas a un médico lo antes posible. ¿Quieres que te ayude a agendar una cita?",
                "Lamento escuchar que te sientes mal. ¿Has tomado algún medicamento? Si los síntomas continúan, te recomendaría visitar a un médico.",
                "Es importante cuidarte, especialmente si sientes que algo no va bien. ¿Te gustaría que busque un centro médico cercano para ti?",
                "Me preocupa que te sientas así. Descansar y mantenerse hidratado es crucial. Si los síntomas empeoran, por favor considera visitar a un profesional de la salud.",
                "Escuchar que no te sientes bien es preocupante. Asegúrate de descansar y beber suficiente agua. ¿Hay algo más que pueda hacer por ti, como encontrar una farmacia cercana?",
                "Tu salud es lo más importante. Si tienes presentas sintomas que te preocupan, podría ser una buena idea hablar con un médico. ¿Puedo ayudarte a encontrar atención médica?",
                "Parece que necesitas cuidarte un poco. Mantenerte en reposo y bien hidratado son pasos importantes. Si sientes que necesitas ver a un médico, estoy aquí para ayudarte a hacer una cita.",
                "Lamento que no te encuentres bien. A veces, los síntomas pueden ser señal de algo que necesita atención médica. ¿Te gustaría que te busque un servicio de salud para evaluar tus síntomas?"
            ]
        },
        {
            "tag": "proxima_cita",
            "patterns": [
                "cuando es mi próxima cita",
                "¿Mi cita cuando es?",
                "quiero saber mi siguiente cita",
                "qué día es mi próxima cita",
                "necesito confirmar la fecha de mi próxima cita",
                "cuándo tengo agendada mi próxima visita",
                "podrías informarme sobre mi próxima cita médica",
                "¿serías tan amable de decirme la fecha y la hora de mi próxima cita?",
                "me podrías confirmar el día y la hora de mi siguiente visita médica",
                "tengo curiosidad sobre cuándo está programada mi próxima cita",
                "podrías verificar cuándo es mi próxima cita con el doctor",
                "necesitaría saber cuándo es mi próxima visita programada"
            ],
            "responses": [
                "Tu próxima cita es el {date} a las {time} con el médico {doctor} por el motivo de {reason}. ¿Hay algo más en que pueda asistirte?",
                "Déjame verificar... tu siguiente cita es el {date} a las {time} con el médico {doctor}, debido a {reason}. ¿Necesitas algo más?",
                "Has reservado tu siguiente cita para el {date} a las {time} con el médico {doctor} por motivo de {reason}. ¿Necesitas más información?",
                "La fecha de tu próxima cita es el {date} a las {time} con el médico {doctor}, y el motivo es {reason}. ¿Hay algo más en que pueda asistirte?",
                "Estoy viendo que tu siguiente cita es el {date} a las {time} con el médico {doctor}. El motivo de la cita es {reason}. ¿Puedo ayudarte con algo más?",
                "Según lo que tengo registrado, tu próxima cita médica es el {date} a las {time} con {doctor} por {reason}. ¿Te gustaría saber algo más?"
            ]
        },
        {
            "tag": "ultima_cita",
            "patterns": [
                "cuándo fue mi última cita",
                "quiero saber mi última cita",
                "cuál fue mi última cita",
                "de cuándo es la última cita mía",
                "podrías decirme cuándo fue mi última visita al consultorio",
                "necesito recordar mi última cita",
                "cuándo visité por última vez el consultorio",
                "dime la fecha de mi última cita",
                "recuérdame la última vez que estuve allí",
                "dame la fecha de mi cita pasada"
            ],
            "responses": [
                "Tu última cita fue el {date} a las {time} con el médico {doctor} por el motivo de {reason}. ¿Hay algo más en que pueda asistirte?",
                "Déjame ver... tu última cita fue el {date} a las {time} con el médico {doctor}, debido a {reason}. ¿Necesitas algo más?",
                "Tu última cita se realizó el {date} a las {time} con el médico {doctor}, el motivo fue {reason}. ¿Hay algo más con lo que necesites ayuda?",
                "Revisando tus registros, tu última cita ocurrió el {date} a las {time} con el médico {doctor}, y el motivo fue {reason}. ¿Puedo ayudarte con algo más?",
                "Acabo de comprobar que tu última cita tuvo lugar el {date} a las {time} con el médico {doctor}. El motivo de la cita fue {reason}. ¿Necesitas otro servicio o tienes alguna otra consulta?",
                "Tu última cita se realizó el {date} a las {time} con el médico {doctor} sobre {reason}. ¿Hay algo más con lo que necesites ayuda?"
            ]
        },
        {
            "tag": "agradecimiento",
            "patterns": [
                "ok, gracias",
                "muchas gracias",
                "te lo agradezco",
                "estoy agradecido",
                "eres muy amable",
                "bueno, gracias",
                "dale, gracias",
                "vale, gracias",
                "aprecio la asistencia que me has proporcionado",
                "fue de gran ayuda"
            ],
            "responses": [
                "¡De nada! Estoy aquí para ayudarte con cualquier cosa que necesites.",
                "No hay de qué. Siempre estoy disponible para asistirte.",
                "Es un placer ayudarte. No dudes en contactarme si necesitas más ayuda."
            ]
        },
        {
            "tag": "datos_privados",
            "patterns": [
                "¿Cuál es mi correo?",
                "Necesito mi contraseña",
                "Dime mi identificación",
                "¿Puedes darme mi número de identificación?",
                "¿Cuál es mi número de identificación?",
                "¿Puedes confirmarme mis datos personales?",
                "¿Puedes verificar algunos de mis datos personales?"
            ],
            "responses": [
                "Por razones de seguridad, no puedo proporcionar detalles como tu correo, contraseña o identificación. Te recomiendo acceder a tu cuenta personal a través de nuestra página web o aplicación para gestionar y visualizar de manera segura esta información.",
                "Entiendo que necesites esa información, pero por seguridad no puedo divulgar datos personales como correos, contraseñas o números de identificación. Puedes revisar estos detalles iniciando sesión en tu cuenta en nuestra plataforma.",
                "Para proteger tu privacidad y seguridad, no estoy autorizado a proporcionar o confirmar datos personales sensibles como correos electrónicos o números de identificación. Por favor, utiliza las herramientas seguras en nuestra app o sitio web para acceder a esos datos.",
                "Lamento las molestias, pero por políticas de seguridad, no puedo compartir información confidencial como tu correo o contraseña. Por favor, accede a tu perfil en nuestra aplicación o sitio web para consultar o actualizar tus datos de manera segura."
            ]
        },
        {
            "tag": "cortes",
            "patterns": [
                "¿Qué hacer si me corto?",
                "¿Cómo curar los cortes?",
                "¿Qué medicamento aplicar para los Cortes?",
                "¿Qué aplicar en los cortes?",
                "cortes"
            ],
            "responses": [
                "Lave el corte adecuadamente para prevenir infecciones y detenga el sangrado aplicando presión durante 1 a 2 minutos hasta que se detenga el sangrado. Aplique vaselina para asegurarse de que la herida esté húmeda para una curación rápida. Finalmente cubra el corte con una venda esterilizada. Se pueden aplicar analgésicos como el paracetamol."
            ]
        },
        {
            "tag": "raspaduras",
            "patterns": [
                "¿Cómo se tratan las raspaduras?",
                "¿Las raspaduras causan cicatrices?",
                "raspaduras",
                "¿Qué hacer si hay raspaduras?",
                "¿Qué medicamento aplicar para las raspaduras?",
                "¿Cómo curar las raspaduras?"
            ],
            "responses": [
                "Comience con las manos lavadas. Limpie suavemente el área con agua fría o tibia y un jabón suave. Retire la suciedad u otras partículas de la herida con unas pinzas esterilizadas. Para un raspado leve que no sangra, deje la herida descubierta. Si la herida sangra, use un paño o vendaje limpio y aplique una presión suave en el área para detener el sangrado. Cubra una herida que haya sangrado con una fina capa de ungüento antibiótico tópico, como Bacitracina, o un ungüento barrera contra la humedad estéril, como Aquaphor. Cúbralo con una venda o gasa limpia. Limpie suavemente la herida y cambie el ungüento y el vendaje una vez al día. Observe el área para detectar signos de infección, como dolor o enrojecimiento e hinchazón. Consulte a su médico si sospecha una infección."
            ]
        },
        {
            "tag": "picaduras",
            "patterns": [
                "¿Cómo se trata una picadura?",
                "Picaduras",
                "¿Qué hacer si te pica?",
                "¿Qué medicamento aplicar si pica?"
            ],
            "responses": [
                "Retire cualquier aguijón inmediatamente. Algunos expertos recomiendan raspar el aguijón con una tarjeta de crédito. La aplicación de hielo en el sitio puede proporcionar un leve alivio. Aplique hielo durante 20 minutos una vez cada hora según sea necesario. Envuelva el hielo en una toalla o coloque un paño entre el hielo y la piel para evitar que se congele la piel. Tomar un antihistamínico como difenhidramina (Benadryl) o uno no sedante como loratadina (Claritin) ayudará con la picazón y la hinchazón. Tome acetaminofén (Tylenol) o ibuprofeno (Motrin) para aliviar el dolor según sea necesario. Lave el sitio de la picadura con agua y jabón. Aplicar una crema de hidrocortisona sobre la picadura puede ayudar a aliviar el enrojecimiento, la picazón y la hinchazón."
            ]
        },
        {
            "tag": "Astilla",
            "patterns": [
                "Cómo quitar puyas",
                "¿Cómo curar las astillas?",
                "¿Qué hacer si tengo astillas?",
                "¿Cómo se saca una espina a la superficie?"
            ],
            "responses": [
                "1. REMOJARLO EN SALES DE EPSOM. Disuelva una taza de sales en un baño tibio y remoje cualquier parte del cuerpo que tenga la astilla. En su defecto, también puedes poner algunas de las sales en una venda y dejarla tapada durante un día; Esto eventualmente ayudará a sacar la astilla a la superficie. 2. VINAGRE O ACEITE. Otra forma sencilla de sacar esa astilla rebelde es remojar la zona afectada en aceite (de oliva o de maíz) o vinagre blanco. Simplemente vierta un poco en un recipiente y remoje el área durante unos 20 a 30 minutos."
            ]
        },
        {
            "tag": "Esguinces",
            "patterns": [
                "¿Cómo se trata un esguince?",
                "¿Qué hacer si me hago un esguince?",
                "¿Qué crema aplicar si me hago un esguince?",
                "¿Qué medicamento aplicar si me hago un esguince?"
            ],
            "responses": [
                "Use una bolsa de hielo o un baño de aguanieve inmediatamente durante 15 a 20 minutos y repita cada dos o tres horas mientras esté despierto. Para ayudar a detener la hinchazón, comprima el tobillo con una venda elástica hasta que se detenga la hinchazón. En la mayoría de los casos, los analgésicos, como el ibuprofeno (Advil, Motrin IB, otros) o el naproxeno sódico (Aleve, otros) o el paracetamol (Tylenol, otros) son suficientes para controlar el dolor de un esguince de tobillo."
            ]
        },
        {
            "tag": "Lesiones musculares",
            "patterns": [
                "¿Cómo se trata una distensión muscular?",
                "¿Qué debo hacer si me duele un musculo?",
                "¿Qué crema debo aplicar si me duele un músculo?",
                "¿Qué medicamento debo usar si tengo una distensión muscular?",
                "¿Cómo se diagnostica una distensión muscular?",
                "¿Es mejor usar calor o hielo para un desgarro muscular?"
            ],
            "responses": [
                "El reposo, el hielo, la compresión y la elevación son efectivos para tratar distensiones musculares. Evita usar el músculo lesionado durante unos días, especialmente si el movimiento causa más dolor. Aplica hielo inmediatamente después de sufrir la lesión para minimizar la hinchazón. No coloques el hielo directamente sobre la piel; usa una bolsa de hielo envuelta en una toalla. Para reducir la hinchazón, envuelve el área afectada con una venda elástica hasta que la hinchazón disminuya."
            ]
        },
        {
            "tag": "Fiebre",
            "patterns": [
                "¿Cómo se trata una fiebre leve?",
                "¿Qué hacer si tengo fiebre leve?",
                "¿Qué medicamento tomar si tengo fiebre leve?",
                "fiebre"
            ],
            "responses": [
                "Para tratar la fiebre en casa: 1) Beba muchos líquidos para mantenerse hidratado. 2) Vístase con ropa ligera. 3) Utilice una manta ligera si siente frío, hasta que los escalofríos desaparezcan. 4)Tome acetaminofén (Tylenol, otros) o ibuprofeno (Advil, Motrin IB, otros). 5) Busque ayuda médica si la fiebre dura más de cinco días seguidos."
            ]
        },
        {
            "tag": "Congestión nasal",
            "patterns": [
                "¿Cómo se trata la congestión nasal?",
                "¿Qué hacer si tengo congestión nasal?",
                "¿Qué medicamento tomar si tengo congestión nasal?",
                "¿Qué hacer si tengo la nariz tapada?",
                "¿Cómo se trata la nariz tapada?",
                "¿Cuánto dura la congestión nasal?"
            ],
            "responses": [
                "Cuando esté congestionado, concéntrese en mantener húmedos los conductos nasales y los senos nasales. Para mantener sus fosas nasales húmedas, puede: 1) Usar un humidificador o vaporizador. 2)Beba muchos líquidos. Esto diluirá la mucosidad, lo que podría ayudar a prevenir la obstrucción de los senos nasales. 3) Coloque una toalla húmeda y tibia sobre su cara. Puede aliviar las molestias y abrir las fosas nasales."
            ]
        },
        {
            "tag": "Tos",
            "patterns": [
                "¿Cómo curar la tos?",
                "¿Cómo se trata la tos?",
                "¿Qué hacer si tengo tos?",
                "¿Qué medicamento tomar si tengo tos?",
                "¿Cómo deshacerse de la tos?"
            ],
            "responses": [
                "1) Miel: Use miel para tratar la tos, mezcle 2 cucharaditas (cucharadita) con agua tibia o un té de hierbas. Beba esta mezcla una o dos veces al día. No le dé miel a niños menores de 1 año. 2) Jengibre: Prepare un relajante té de jengibre agregando de 20 a 40 gramos (g) de rodajas de jengibre fresco a una taza de agua caliente. Deje reposar durante unos minutos antes de beber. Agregue miel o jugo de limón para mejorar el sabor y aliviar aún más la tos. 3) Líquidos: Mantenerse hidratado es vital para quienes tienen tos o resfriado. Las investigaciones indican que beber líquidos a temperatura ambiente puede aliviar la tos, la secreción nasal y los estornudos."
            ]
        },
        {
            "tag": "Dolor de garganta",
            "patterns": [
                "¿Cómo se trata el dolor de garganta?",
                "¿Qué hacer si me duele la garganta?",
                "¿Qué medicamento tomar si me duele la garganta?",
                "¿Cómo curar el dolor de garganta?"
            ],
            "responses": [
                "1) Asegúrese de descansar lo suficiente y beber muchos líquidos. 2) Inhale vapor, deje correr agua caliente en un fregadero. Coloque una toalla sobre usted para atrapar el vapor y haga que la persona se incline sobre el fregadero con el agua corriendo. Dígale que respire profundamente por la boca y la nariz durante 5 a 10 minutos. Repetir varias veces al día. 3) Dígale que beba caldo de pollo o té caliente con miel. No le dé miel a un niño menor de 12 meses."
            ]
        },
        {
            "tag": "Problemas gastrointestinales",
            "patterns": [
                "¿Cómo se tratan los problemas de gases?",
                "¿Qué hacer si tengo problemas gastrointestinales?",
                "¿Qué medicamento tomar si tengo problemas de gases?",
                "¿Cómo curar los problemas de gases?",
                "Tego malestar estomacal",
                "Siento dolor de estomago"
            ],
            "responses": [
                "1) Reponer líquidos corporales 2) No tome medicamentos antidiarreicos, laxantes ni analgésicos, a menos que lo indique un profesional médico. 3) Tomar antiácidos puede ayudar, según recomendación de un profesional de la salud. 4) Si es propenso a sufrir acidez estomacal frecuente, busque ayuda médica. 5) Tomar comidas que no sean picantes con regularidad puede aliviar los dolores de las úlceras. 6) Busque ayuda médica si las condiciones persisten o continúan empeorando."
            ]
        },
        {
            "tag": "Problemas de la piel",
            "patterns": [
                "¿Cómo se tratan los problemas de la piel?",
                "¿Qué hacer si tengo alergia en la piel?",
                "¿Qué medicamento tomar si tengo alergia en la piel?",
                "¿Cómo curar la alergia cutánea?"
            ],
            "responses": [
                "1)Crema de hidrocortisona. 2) Ungüentos como la loción de calamina. 3) Antihistamínicos. 4) Compresas frías. 5)Baños de avena. 6) Hable con su médico sobre qué es lo mejor para su sarpullido específico."
            ]
        },
        {
            "tag": "Dolor abdominal",
            "patterns": [
                "¿Cómo se trata el dolor abdominal?",
                "¿Qué hacer si tengo dolor abdominal?",
                "¿Qué medicamento tomar si tengo dolor abdominal?",
                "¿Cómo curar el dolor abdominal?"
            ],
            "responses": [
                "1)Proporcione líquidos claros para sorber, como agua, caldo o jugo de frutas diluido con agua. 2) Sirva alimentos blandos, como galletas saladas, pan común, tostadas secas, arroz, gelatina o puré de manzana. 3) Evite los alimentos picantes o grasosos y las bebidas con cafeína o carbonatadas hasta 48 horas después de que hayan desaparecido todos los síntomas."
            ]
        },
        {
            "tag": "moretones",
            "patterns": [
                "¿Cómo se tratan los moretones?",
                "¿Qué hacer si me sale un moretón?",
                "¿Qué medicamento tomar si me sale un moretón?",
                "¿Cómo curar los moretones?",
                "¿Cómo curar un morado?",
                "¿Qué hago si me sale un morado?"
            ],
            "responses": [
                "1) Aplique hielo al hematoma con una bolsa de hielo envuelta en una toalla. 2) Déjalo actuar de 10 a 20 minutos. 3) Repita varias veces al día durante uno o dos días según sea necesario. 4)Comprima la zona magullada si está hinchada, utilizando una venda elástica."
            ]
        },
        {
            "tag": "Dedo roto",
            "patterns": [
                "¿Cómo se trata un dedo roto?",
                "¿Qué hacer si me rompo el dedo del pie?",
                "¿Qué medicamento tomar si me rompo el dedo del pie?",
                "¿Cómo curar el dedo roto?"
            ],
            "responses": [
                "1) Para ayudar a disminuir el dolor y la hinchazón en un dedo roto, eleve el pie, aplique hielo en la lesión y manténgase alejado del pie. 2) Dependiendo de la gravedad de la fractura, es posible que sea necesario volver a colocar el dedo en su lugar (reducirlo) y algunas fracturas compuestas del dedo pueden requerir cirugía. 3) La mayoría de los dedos rotos se curan sin complicaciones en seis semanas."
            ]
        },
        {
            "tag": "asfixia",
            "patterns": [
                "¿Cómo se trata la asfixia?",
                "¿Qué hacer si me ahogo?",
                "¿Qué medicamento tomar si me ahogo?",
                "¿Cómo curar la asfixia?"
            ],
            "responses": [
                "1) Anímelos a seguir tosiendo para intentar eliminar la obstrucción. 2)Pídales que intenten escupir el objeto si lo tiene en la boca. 3) Si la tos no funciona, comience con golpes en la espalda y compresiones abdominales."
            ]
        },
        {
            "tag": "Herida",
            "patterns": [
                "¿Cómo se trata una herida?",
                "¿Qué hacer si recibo una herida?",
                "¿Qué medicamento tomar si me lastimo?",
                "¿Cómo curar una herida?"
            ],
            "responses": [
                "1) Enjuague el corte o herida con agua y aplique presión con una gasa esterilizada, una venda o un paño limpio. 2) Si la sangre empapa el vendaje, coloque otro vendaje encima del primero y siga aplicando presión. 3) Levante la parte del cuerpo lesionada para frenar el sangrado. 4) Cuando deje de sangrar, cubra la herida con una venda nueva y limpia."
            ]
        },
        {
            "tag": "Diarrea",
            "patterns": [
                "¿Cómo se trata la diarrea?",
                "¿Qué hacer si tengo diarrea?",
                "¿Qué medicamento tomar si tengo diarrea?",
                "¿Cómo curar la diarrea?"
            ],
            "responses": [
                "1) Hidratar el cuerpo es esencial para recuperarse de la diarrea, lo que hace que el cuerpo pierda electrolitos como el sodio y el cloruro. 2) Es muy recomendable evitar los productos lácteos, ya que pueden empeorar la diarrea en algunas personas. 3) Sin embargo, si la diarrea dura más de 2 días, busque atención médica para evitar complicaciones."
            ]
        },
        {
            "tag": "Quemaduras de congelacion",
            "patterns": [
                "¿Cómo se trata una quemadura por congelación?",
                "¿Qué debo hacer si tengo una congelación?",
                "¿Qué medicamento debo tomar para una congelación?",
                "¿Cómo curar las quemaduras por congelación?"
            ],
            "responses": [
                "1)Salir del frío. Una vez que estés en un espacio cálido, quítate la ropa mojada y envuélvete en una manta abrigada. 2) Vuelva a calentar suavemente las zonas congeladas. Remoje los dedos de las manos, los pies u otras extremidades congelados en agua tibia: de 105 a 110 F (alrededor de 40 a 43 C). Si no hay un termómetro disponible, pruebe el agua colocando una mano o un codo sanos en ella; debe sentirse muy tibia, no caliente. Remoje durante 20 a 30 minutos o hasta que la piel adquiera su color normal o pierda el entumecimiento. Para la cara o las orejas, aplique una toallita húmeda y tibia."
            ]
        },
        {
            "tag": "Agotamiento por calor",
            "patterns": [
                "¿Cómo se trata el agotamiento por calor?",
                "¿Qué hacer si me siento agotado por el calor?",
                "¿Qué medicamento tomar si me canso?",
                "¿Cómo curar el agotamiento por calor?",
                "El calor me tiene agotado"
            ],
            "responses": [
                "1) Salga del calor y coloquese en un lugar con sombra o con aire acondicionado. Acueste a la persona y eleve ligeramente las piernas y los pies. Quítese la ropa ajustada o pesada. Haga que la persona beba agua fría u otra bebida no alcohólica sin cafeína."
            ]
        },
        {
            "tag": "Golpe de calor",
            "patterns": [
                "¿Cómo se trata el golpe de calor?",
                "¿Qué hacer si sufro un golpe de calor?",
                "¿Qué medicamento tomar si tengo un derrame cerebral?",
                "¿Cómo curar un golpe de calor?"
            ],
            "responses": [
                "1) Enfríe todo el cuerpo de la persona aplicando una esponja o rociando agua fría y abaníquela para ayudar a bajar su temperatura corporal. Esté atento a los signos de insolación que progresa rápidamente, como convulsiones, pérdida del conocimiento durante más de unos pocos segundos y dificultad para respirar de moderada a grave."
            ]
        },
        {
            "tag": "Picaduras de insectos",
            "patterns": [
                "¿Cómo se trata una picadura de insecto?",
                "¿Qué hacer si me pica un insecto?",
                "¿Qué medicamento tomar si me pica un insecto?",
                "¿Cómo curar la picadura de insecto?"
            ],
            "responses": [
                "1) Lavar la zona afectada con agua y jabón. Aplique una compresa fría (como una franela o un paño enfriado con agua fría) o una bolsa de hielo sobre cualquier hinchazón durante al menos 10 minutos. Eleve o eleve el área afectada si es posible, ya que esto puede ayudar a reducir la hinchazón."
            ]
        },
        {
            "tag": "sangrado de nariz",
            "patterns": [
                "¿Cómo se trata una hemorragia nasal?",
                "¿Qué hacer si me sangra la nariz?",
                "¿Qué medicamento tomar si me sangra la nariz?",
                "¿Cómo curar el sangrado nasal?"
            ],
            "responses": [
                "1) Lavar la zona afectada con agua y jabón. Aplique una compresa fría (como una franela o un paño enfriado con agua fría) o una bolsa de hielo sobre cualquier hinchazón durante al menos 10 minutos. Eleve o eleve el área afectada si es posible, ya que esto puede ayudar a reducir la hinchazón."
            ]
        },
        {
            "tag": "Músculo estirado",
            "patterns": [
                "¿Cómo se trata un tirón muscular?",
                "¿Qué hacer si me tiran el músculo?",
                "¿Qué medicamento tomar si tengo un tirón muscular?",
                "¿Cómo curar un tirón muscular?"
            ],
            "responses": [
                "1) Aplique hielo durante 10 a 15 minutos cada 1 hora durante el primer día y cada 3 a 4 horas después. Utilice hielo durante los primeros 3 días. Después de 3 días, el calor o el hielo pueden resultar útiles si todavía siente dolor. Descanse el músculo tirado durante al menos un día."
            ]
        },
        {
            "tag": "Sangrado rectal",
            "patterns": [
                "¿Cómo se trata el sangrado en el ano?",
                "¿Qué hacer si tengo un sangrado rectal?",
                "¿Qué medicamento tomar si tengo sangrado en el ano?",
                "¿Cómo curar el sangrado en el recto?"
            ],
            "responses": [
                "1) Para el sangrado mínimo debido a hemorroides o fisuras rectales, los médicos generalmente indicarán un tratamiento en el hogar con mucha agua, bolsas de hielo y posiblemente ungüentos o supositorios de venta libre para crear movimiento en los intestinos o ablandar las heces. El tratamiento de emergencia puede incluir una vía intravenosa en caso de deshidratación."
            ]
        },
        {
            "tag": "Quemadura de sol",
            "patterns": [
                "¿Cómo se tratan las quemaduras solares?",
                "¿Qué hacer si me quemo con el sol?",
                "¿Qué medicamento tomar si tengo quemaduras solares?",
                "¿Cómo curar una quemadura de sol?"
            ],
            "responses": [
                "1) Refresque la piel, 2) Beba agua para prevenir la deshidratación. 3) Tome un analgésico como ibuprofeno (Advil, Motrin IB, otros) para ayudar con el malestar y la hinchazón de las quemaduras solares."
            ]
        },
        {
            "tag": "Dolor de testículo",
            "patterns": [
                "¿Cómo se trata el dolor de testículos?",
                "¿Qué hacer si tengo dolor de testículos?",
                "¿Qué medicamento tomar si tengo dolor de testículos?",
                "¿Cómo curar el dolor de testículos?"
            ],
            "responses": [
                "1) Para el dolor, tome medicamentos de venta libre como paracetamol (Tylenol) o ibuprofeno (Advil, Motrin). Para la hinchazón, aplique una bolsa de hielo en el escroto."
            ]
        },
        {
            "tag": "Vértigo",
            "patterns": [
                "¿Cómo se trata el vértigo?",
                "¿Qué hacer si tengo vértigo?",
                "¿Qué medicamento tomar si tengo vértigo?",
                "¿Cómo curar un vértigo?"
            ],
            "responses": [
                "1) Aliviar o Prevenir los Mareos. Haga que la persona se recueste y descanse. 2) Mantenga a la persona segura. Ayude a la persona a evitar caídas. 3) Llame a un proveedor de atención médica. Un proveedor de atención médica debe controlar cualquier signo o síntoma nuevo de vértigo."
            ]
        },
        {
            "tag": "Sangrado normal",
            "patterns": [
                "¿Cómo se trata el sangrado?",
                "¿Qué hacer si tengo un sangrado?",
                "¿Qué medicamento tomar si me sangra?",
                "¿Cómo curar el sangrado?"
            ],
            "responses": [
                "1) Las acciones de primeros auxilios para controlar la hemorragia externa incluyen aplicar presión directa sobre la herida, mantener la presión con almohadillas y vendajes y, si es posible, elevar la extremidad lesionada por encima del nivel del corazón."
            ]
        },
        {
            "tag": "Herida de ojo",
            "patterns": [
                "¿Cómo se trata una lesión ocular?",
                "¿Qué hacer si tengo una lesión en el ojo?",
                "¿Qué medicamento tomar si me lastimé el ojo?",
                "¿Cómo curar el ojo lesionado?"
            ],
            "responses": [
                "1) NO se frote el ojo, 2) Parpadee varias veces y permita que las lágrimas eliminen la partícula, 3) Levante el párpado superior sobre las pestañas del párpado inferior para permitir que las pestañas intenten expulsar la partícula., 4) Utilice enjuague ocular, solución salina o agua corriente del grifo para enjuagar el ojo"
            ]
        },
        {
            "tag": "Quemadura química",
            "patterns": [
                "¿Cómo se trata una quemadura química?",
                "¿Qué hacer si tengo una quemadura química?",
                "¿Qué medicamento tomar si me quemo por productos químicos?",
                "¿Cómo curar una quemadura química?"
            ],
            "responses": [
                "1) enjuagar con agua · Enjuagar el área durante al menos 20 minutos. · Mientras enjuaga el área, quítate cualquier ropa o joyería que tenga el químico, 2) No uses un chorro de agua fuerte, si es posible. 3) No intentes neutralizar la quemadura con ácido o álcali. . Esto podría provocar una reacción química que empeore la quemadura. 4) No aplique pomada antibiótica sobre la quemadura."
            ]
        },
        {
            "tag": "Veneno",
            "patterns": [
                "¿Cómo se trata un veneno?",
                "¿Qué hacer si me da veneno?",
                "¿Qué medicamento tomar si me intoxican?",
                "¿Cómo curar el envenenamiento?"
            ],
            "responses": [
                "1) Salga al aire libre de inmediato. Llame a la línea gratuita de Poison Help (1-800-222-1222), que lo conecta con su centro local de intoxicaciones. 2) Quítese la ropa que haya tocado el veneno. Enjuague la piel con agua corriente durante 15 a 20 minutos. Llame a la línea gratuita de Poison Help (1-800-222-1222), que lo conecta con su centro local de intoxicaciones.,3) Si la persona tragó el medicamento equivocado o demasiado medicamento: Llame a Poison Help (1-800- 222-1222), que lo conecta con su centro local de intoxicaciones.,4) Cada intoxicación es diferente."
            ]
        },
        {
            "tag": "Dientes",
            "patterns": [
                "¿Cómo se tratan los dientes rotos?",
                "¿Qué hacer si se me rompen los dientes?",
                "¿Qué medicamento tomar si se me rompen los dientes?",
                "curar los dientes rotos?"
            ],
            "responses": [
                "1) lamer el diente para limpiarlo si está sucio o enjuagarlo con agua. volver a colocarlo en su posición (sólo dientes permanentes); Nunca intente volver a insertar un diente de leche (ver más abajo). Muerda un pañuelo para mantener el diente en su lugar. ir al dentista como emergencia"
            ]
        },
        {
            "tag": "convulsión",
            "patterns": [
                "¿Cómo se trata una convulsión?",
                "¿Qué hacer si tengo una convulsión?",
                "¿Qué medicamento tomar si tengo convulsiones?",
                "¿Cómo curar las convulsiones?"
            ],
            "responses": [
                "1) Mantenga la calma y permanezca con la persona, 2) Si tiene comida o líquido en la boca, gírela de lado inmediatamente, 3) Coloque algo suave debajo de su cabeza y afloje la ropa ajustada."
            ]
        },
        {
            "tag": "Lesión craneal",
            "patterns": [
                "¿Cómo se trata una lesión en la cabeza?",
                "¿Qué hacer si tengo una lesión en la cabeza?",
                "¿Qué medicamento tomar si me lesiono la cabeza?",
                "¿Cómo curar una lesión en la cabeza?"
            ],
            "responses": [
                "1) Aplicar presión firme sobre la herida con una gasa esterilizada o un paño limpio. Pero no aplique presión directa sobre la herida si sospecha una fractura de cráneo."
            ]
        },
        {
            "tag": "Desmayo",
            "patterns": [
                "¿Cómo se trata el desmayo?",
                "¿Qué hacer si tengo ganas de desmayarme?",
                "¿Qué medicamento tomar si me desmayo?",
                "¿Cómo curar el desmayo?"
            ],
            "responses": [
                "1) Acuéstate o siéntate. Para reducir la posibilidad de volver a desmayarse, no se levante demasiado rápido, 2) Coloque la cabeza entre las rodillas si se sienta, 3) Coloque a la persona boca arriba. Si no hay lesiones y la persona respira, levante las piernas por encima del nivel del corazón, aproximadamente 12 pulgadas (30 centímetros), si es posible. Afloje cinturones, cuellos u otras prendas apretadas."
            ]
        },
        {
            "tag": "Dolor de cabeza",
            "patterns": [
                "¿Cómo se trata un dolor de cabeza leve?",
                "¿Qué hacer si tengo un dolor de cabeza leve?",
                "¿Qué medicamento tomar si tengo dolor de cabeza leve?",
                "¿Cómo curar un dolor de cabeza leve?"
            ],
            "responses": [
                "Administre ibuprofeno (Advil, Motrin), aspirina o acetaminofén (Tylenol) para el dolor. Evite el ibuprofeno y otros AINE si la persona tiene insuficiencia cardíaca o renal. No le dé aspirina a un niño menor de 18 años."
            ]
        },
        {
            "tag": "Frío",
            "patterns": [
                "¿Cómo se trata un resfriado?",
                "¿Qué hacer si tengo un resfriado leve?",
                "¿Qué medicamento tomar si estoy resfriado?",
                "¿Cómo curar el resfriado?"
            ],
            "responses": [
                "1) Mantenerse hidratado es absolutamente vital para ayudar a \"eliminar\" el resfriado, así como para eliminar la congestión y mantener la garganta lubricada. 2) La vitamina C es extremadamente útil para combatir infecciones, por lo que ante la primera señal de un resfriado, asegúrese de aumentar su ingesta comiendo muchas bayas, frutas cítricas, papayas, brócoli y pimientos rojos que lo ayudarán a mantenerse protegido. 3) Cuando se trata de combatir un resfriado, la vitamina D es esencial para ayudar a regular la respuesta inmune."
            ]
        },
        {
            "tag": "Erupción",
            "patterns": [
                "¿Cómo se tratan las erupciones?",
                "¿Qué hacer si tengo un sarpullido?",
                "¿Qué medicamento tomar si tengo erupción?",
                "¿Cómo curar la erupción?"
            ],
            "responses": [
                "1) El aceite de oliva ayuda a la curación y promueve la renovación de la piel, ya que está repleto de vitamina E y antioxidantes. También calma la piel y reduce el picor. 2) El bicarbonato de sodio es útil para secar las erupciones cutáneas y también para aliviar la picazón y la inflamación. 3) Aloe Vera. Gracias a sus propiedades antibacterianas, antifúngicas, antiinflamatorias y emolientes, el aloe vera es excelente para tratar una serie de dolencias de la piel, incluidas erupciones cutáneas, y también para calmar la piel."
            ]
        },
        {
            "tag": "mordedura de serpiente",
            "patterns": [
                "¿Cómo se trata una mordedura de serpiente?",
                "¿Qué hacer si me muerde una serpiente?",
                "¿Qué medicamento tomar si me muerde una serpiente?",
                "¿Cómo curar la mordedura de serpiente?",
                "me mordió una serpiente"
            ],
            "responses": [
                "Mientras espera ayuda médica: 1) Mueva a la persona más allá de la distancia de ataque de la serpiente. 2) Haga que la persona se acueste con la herida debajo del corazón. 3)Mantener a la persona tranquila y en reposo, permaneciendo lo más quieta posible para evitar que el veneno se propague. 4) Cubra la herida con una venda estéril suelta. 5) Quítese todas las joyas del área mordida. 6) Quitarse los zapatos si la pierna o el pie fueron mordidos."
            ]
        },
        {
            "tag": "mordida de animal",
            "patterns": [
                "¿Cómo se trata la mordedura de un animal?",
                "¿Cómo se trata una mordedura de mono?",
                "¿Cómo se trata una mordedura de perro?",
                "¿Qué hacer si me muerde un animal?",
                "¿Qué medicamento tomar si me muerde un mono?",
                "¿Cómo curar la mordedura de perro?",
                "me mordió un perro"
            ],
            "responses": [
                "1)Lavar la herida con agua tibia y jabón. 2) Presione suavemente un paño limpio sobre la herida para detener el flujo de sangre. 3)Aplicar un ungüento antibacteriano a la herida. 4) Cubrir con una venda esterilizada. 5) Esté atento a signos de infección. 6) Busque ayuda si sospecha de infección o posible exposición a la rabia, o si la herida es grave."
            ]
        },
        {
            "tag": "Ahogo",
            "patterns": [
                "¿Qué hacer si alguien se está ahogando?",
                "¿Qué hacer si alguien se ahoga?",
                "¿Qué medidas debo tomar si veo a una persona ahogándose?",
                "¿Cómo ayudar a una persona que se está ahogando?"
            ],
            "responses": [
                "1)Coloque su oreja al lado de la boca y la nariz de la persona. ¿Sientes aire en tu mejilla? 2) Mire para ver si el pecho de la persona se mueve. Si la persona no respira, controle el pulso. 3) Compruebe el pulso de la persona durante 10 segundos. Si no hay pulso, inicie la RCP."
            ]
        },
        {
            "tag": "RCP",
            "patterns": [
                "¿Podrías explicarme cómo realizar la resucitacion cardiopulmonar o rcp?",
                "Cuéntame los pasos para hacer resucitacion cardiopulmonar o RCP",
                "Necesito saber cómo se hace la resucitacion cardiopulmonar o RCP",
                "Explícame qué debo hacer durante la resucitacion cardiopulmonar o rcp",
                "Dime los pasos que debo seguir para aplicar resucitacion cardiopulmonar o rcp",
                "¿Cómo puedo ayudar a alguien que necesita resucitacion cardiopulmonar o RCP?"
            ],
            "responses": [
                "1) Para un adulto o un niño, coloque la palma de una mano en el centro del pecho en la línea del pezón. También puedes empujar con una mano encima de la otra. En el caso de un bebé, coloque dos dedos sobre el esternón. \n 2) Para un adulto o un niño, presione hacia abajo al menos 2 pulgadas. Asegúrate de no presionar las costillas. Para un bebé, presione hacia abajo aproximadamente 1 y 1/2 pulgadas. Asegúrese de no presionar el extremo del esternón. 3) Realice únicamente compresiones torácicas, a un ritmo de 100 a 120 por minuto o más. Deje que el pecho se eleve completamente entre empujones. 4) Verifique si la persona ha comenzado a respirar."
            ]
        },
        {
            "tag": "Fractura",
            "patterns": [
                "¿Cuál es el tratamiento adecuado para una fractura?",
                "¿Qué pasos debo seguir si creo que tengo una fractura?",
                "¿Qué medicamentos son recomendables para aliviar el dolor de una fractura?",
                "¿Qué puedo hacer para curar una fractura correctamente?"
            ],
            "responses": [
                "1)Detener cualquier sangrado. Aplique presión sobre la herida con una venda esterilizada, un paño limpio o una prenda de vestir limpia. 2)Inmovilizar la zona lesionada. No intente realinear el hueso ni empujar hacia adentro un hueso que sobresale. Si ha recibido capacitación sobre cómo entablillar y no hay ayuda profesional disponible, aplique una férula en el área por encima y por debajo de los sitios de fractura. Acolchar las férulas puede ayudar a reducir las molestias. 3) Aplique compresas de hielo para limitar la hinchazón y ayudar a aliviar el dolor. No aplique hielo directamente sobre la piel. Envuelve el hielo en una toalla, trozo de tela o algún otro material. 4)Trate el shock. Si la persona se siente débil o respira con respiraciones cortas y rápidas, acuéstela con la cabeza ligeramente más baja que el tronco y, si es posible, eleve las piernas."
            ]
        }
    ]
}